In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# REMOVING DUPLICATES:

data1 = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]});

data1

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [3]:
data1.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [4]:
data1.drop_duplicates() #returns only the unique

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [5]:
# by default duplicates throuout all the cols are considered
# alternatively you can specify any subset of them to detect duplicates 

data1['v1']=range(7); # assign additional col in data1
data1

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [6]:
data1.drop_duplicates(['k1']) # rows 1,2,4,5,6 are all marked as duplic

    k1  k2  v1
0  one   1   0
3  two   3   3

In [7]:
data1.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
2  one   2   2
6  two   4   6

In [8]:
data1

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [9]:
data1.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [10]:
# Using Mapping:

In [11]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                'corned beef', 'Bacon', 'pastrami', 'honey ham',
                'nova lox'],
                'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [12]:
data #note: some food types begin with capital letters

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [13]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
};

meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [14]:
# create col 'animal', refer to the col 'food' and add vals 
# from 'meat_to_animal' dict
# it won't work without str.lower

data['animal']=data['food'].map(str.lower).map(meat_to_animal);
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [15]:
# REPLACE VALUES:
# pandas understands NaN as missing values- replace -999 with NaN

datax = Series([1., -999., 2., -999., -1000., 3.]);
datax

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
datax.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
datax.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [18]:
datax.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
# Renaming Axis Indexes:

datay = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four']);

datay

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
datay.index=datay.index.map(str.upper);
datay

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [23]:
datay.rename(columns=str.upper)

          ONE  TWO  THREE  FOUR
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [24]:
datay

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [25]:
datay.index=datay.index.map(str.lower);
datay

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [26]:
#If you want to create a transformed version of a data set without 
# modifying the original, a useful method is rename:

datay.rename(index={'ohio': 'INDIANA'},
            columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
colorado    4    5         6     7
new york    8    9        10    11

In [27]:
datay

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [28]:
# BINNING

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [31]:
#divide these into bins of 18 to 25, 26 to 35, 35 to 60, 60 and older
bins = [18, 25, 35, 60, 100]

In [32]:
cats=pd.cut(ages, bins);
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [33]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64